[
    {
      "title": "How do I build the node-template to a library file?",
      "content": "The bounty expires in 10 minutes. Answers to this question are eligible for a +50 reputation bounty. Clark Lee is looking for an answer from a reputable source. I have a custom chain based on substrate-node-template. How do I build the repo to a library file so that I can easily sign a tx in another C#/Qt/Java project by integrating the library file?",
      "user_id": "1"
    },
    {
      "title": "How to show firestore all document fields on PaginatedDataTable as streambuilder on flutter web?",
      "content": "I am able to show normal text fields on PaginatedDataTable. But I want to show my Firestore fields on PaginatedDataTable as stream builder method. I have searched on internet but I could not find relevant to my requirement. How to get firestore data in to PaginatedDataTable source. Or is there any other way Please let me know. Looking for solution and It is very useful if there is get on tapeable row or selectable row also. I want to fetch data from firestore only not from firebase auth. And I have named the firestore collection name as 'users'. it my be different also Need help how to do this?",
      "user_id": "2"
    },
    {
      "title": "Most appropriate way to write long questions with tests?",
      "content": "I have a question about my Stack Overflow post: Functions for a search tree where each node has three children (similar to BST) - Python I want to know if my above question has been written properly. I have written all kinds of testing and example inputs/outputs and I have separated them, however, the question then becomes really long as you can see and may put people off from answering. Also, is it okay to write testing code and normal code the same way since it can easily be confused? Lastly, if my question is to do with three functions within one problematic class (i.e. a problem regarding one class), then is my question focused enough?",
      "user_id": "3"
    },
    {
      "title": "Helpful flags were raised in my name",
      "content": "I'm 100% sure I haven't raised these helpful flags that were attributed to me. I don't have an autoreporting script running. What happened here?",
      "user_id": "4"
    },
    {
      "title": "How do you reverse a string in-place in JavaScript?",
      "content": "How do you reverse a string in-place in JavaScript when it is passed to a function with a return statement, without using built-in functions (.reverse(), .charAt() etc.)?",
      "user_id": "5"
    },
    {
      "title": "How do you reverse a string in-place in JavaScript?",
      "content": "How do you reverse a string in-place in JavaScript when it is passed to a function with a return statement, without using built-in functions (.reverse(), .charAt() etc.)?",
      "user_id": "5"
    },
    {
      "title": "How to beat the gym boss in Lavender Town.",
      "content": "Lavender Town is... well, apart from being a lavender colored town... a super-sized cemetery city for Pokémon. The first time you visit here you won't be able to fully explore Pokemon Tower but you'll have to briefly explore it to continue the story.",
      "user_id": "6"
    }
  ]